Revit 2015 API
Wire.SetVertex Method
 Sets the position of a given vertex.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public void SetVertex(
	int index,
	XYZ vertexPoint
)
Visual Basic
Public Sub SetVertex ( _
	index As Integer, _
	vertexPoint As XYZ _
)
Visual C++
public:
void SetVertex(
	int index,
	XYZ^ vertexPoint
)
Parameters
index
Type: System.Int32
 The index of the existing vertex. Should be between 0 and NumberOfVertices.
vertexPoint
Type: Autodesk.Revit.DB.XYZ
 The new position for the vertex.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The index should be between 0 and the number of vertices of the wire. -or- The vertex point cannot be added to the wire because there is already a vertex at this position on the view plane (within tolerance).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace